davidesottosanti/landtiger-board-lpc17xx/timer/lib_timer.c
/*********************************************************************************************************
**--------------File Info---------------------------------------------------------------------------------
** File name:           lib_timer.h
** Last modified Date:  2014-09-25
** Last Version:        V1.00
** Descriptions:        atomic functions to be used by higher sw levels
** Correlated files:    lib_timer.c, funct_timer.c, IRQ_timer.c
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
#include "lpc17xx.h"
#include "timer.h"
/* INFO
		-->TCR ha 2 bit
				 0) BIT di Enable: 0 Disabilitato, 1 Timer Abilitato
			 	 1) BIT di Reset:  0 Disabilitato, 1 Timer Resettato
				 
 		-->TC contiene il valore corrente del conteggio (READ ONLY)
		
		-->MCR ha 3 bit
		
				 0) BIT di interrupt  0 Disabilitato, 1 Abilitato
				 1) BIT di reset      0 Disabilitato, 1 Abilitato
				 2) BIT di stop       0 Disabilitato, 1 Abilitato
				
								I=interrupt (quando scatta: esegue l'handler)
								R=reset     (quando scatta: azzera la variabile del conteggio)
								S=stop      (quando scatta: smette di contare)
				 
								1: 001  I
								3: 011  RI  (per i timer che ripartono da soli)
								7: 111  SRI 
				 
								2: 010  R
								4: 100  S
								5: 101  SI
								6: 110  SR
				 
*/
//ABILITA TIMER
void enable_timer( uint8_t timer_num ){
  if ( timer_num == 0 ) LPC_TIM0->TCR = 1;
  if ( timer_num == 1 ) LPC_TIM1->TCR = 1;
  if ( timer_num == 2 ) LPC_TIM2->TCR = 1;
  if ( timer_num == 3 ) LPC_TIM3->TCR = 1;
  return;
}
//DISABILITA TIMER
void disable_timer( uint8_t timer_num ){
  if ( timer_num == 0 ) LPC_TIM0->TCR = 0;
  if ( timer_num == 1 ) LPC_TIM1->TCR = 0;
  if ( timer_num == 2 ) LPC_TIM2->TCR = 0;
  if ( timer_num == 3 ) LPC_TIM3->TCR = 0;
  return;
}
//RESETTA TIMER
void reset_timer( uint8_t timer_num ){
  uint32_t regVal;
  
	if ( timer_num == 0 ){
	regVal = LPC_TIM0->TCR;
	regVal |= 0x02;
	LPC_TIM0->TCR = regVal;
  }
	if ( timer_num == 1 ){
	regVal = LPC_TIM1->TCR;
	regVal |= 0x02;
	LPC_TIM1->TCR = regVal;
  }
	if ( timer_num == 2 ){
	regVal = LPC_TIM2->TCR;
	regVal |= 0x02;
	LPC_TIM2->TCR = regVal;
  }
	if ( timer_num == 3 ){
	regVal = LPC_TIM3->TCR;
	regVal |= 0x02;
	LPC_TIM3->TCR = regVal;
	}
  return;
}

uint32_t init_timer ( uint8_t timer_num, uint32_t TimerInterval ){
  if ( timer_num == 0 ){
	LPC_TIM0->MR0 = TimerInterval;

//*** <<< Use Configuration Wizard in Context Menu >>> ***
// <h> timer0 MCR
//   <e.0> MR0I
//	 <i> 1 Interrupt on MR0: an interrupt is generated when MR0 matches the value in the TC. 0
//	 <i> 0 This interrupt is disabled
//   </e>
//   <e.1> MR0R
//	 <i> 1 Reset on MR0: the TC will be reset if MR0 matches it.
//	 <i> 0 Feature disabled.
//   </e>
//   <e.2> MR0S
//	 <i> 1 Stop on MR0: the TC and PC will be stopped and TCR[0] will be set to 0 if MR0 matches the TC
//	 <i> 0 Feature disabled.
//   </e>
//   <e.3> MR1I
//	 <i> 1 Interrupt on MR1: an interrupt is generated when MR0 matches the value in the TC. 0
//	 <i> 0 This interrupt is disabled
//   </e>
//   <e.4> MR1R
//	 <i> 1 Reset on MR1: the TC will be reset if MR0 matches it.
//	 <i> 0 Feature disabled.
//   </e>
//   <e.5> MR1S
//	 <i> 1 Stop on MR1: the TC and PC will be stopped and TCR[1] will be set to 0 if MR1 matches the TC
//	 <i> 0 Feature disabled.
//   </e>
//   <e.6> MR2I
//	 <i> 1 Interrupt on MR2: an interrupt is generated when MR2 matches the value in the TC.
//	 <i> 0 This interrupt is disabled
//   </e>
//   <e.7> MR2R
//	 <i> 1 Reset on MR2: the TC will be reset if MR2 matches it.
//	 <i> 0 Feature disabled.
//   </e>
//   <e.8> MR2S
//	 <i> 1 Stop on MR2: the TC and PC will be stopped and TCR[2] will be set to 0 if MR2 matches the TC
//	 <i> 0 Feature disabled.
//   </e>
//   <e.9> MR3I
//	 <i> 1 Interrupt on MR3: an interrupt is generated when MR3 matches the value in the TC.
//	 <i> 0 This interrupt is disabled
//   </e>
//   <e.10> MR3R
//	 <i> 1 Reset on MR3: the TC will be reset if MR3 matches it.
//	 <i> 0 Feature disabled.
//   </e>
//   <e.11> MR3S
//	 <i> 1 Stop on MR3: the TC and PC will be stopped and TCR[3] will be set to 0 if MR3 matches the TC
//	 <i> 0 Feature disabled.
//   </e>
	LPC_TIM0->MCR = 7;   // TIMER 0: Interrupt, Reset, Stop
// </h>
//*** <<< end of configuration section >>>    ***

				 /*
         I=interrupt (quando scatta: esegue l'handler)
				 R=reset     (quando scatta: azzera la variabile del conteggio)
				 S=stop      (quando scatta: smette di contare)
				 
				 1: 001  I
				 3: 011  RI  (per i timer che ripartono da soli)
				 7: 111  SRI 
				 
				 2: 010  R
				 4: 100  S
				 5: 101  SI
				 6: 110  SR
			   */

	NVIC_EnableIRQ(TIMER0_IRQn);
	return (1);
	
  }else if( timer_num == 1 ){ // TIMER 1
	LPC_TIM1->MR0 = TimerInterval;
	LPC_TIM1->MCR = 7;
	NVIC_EnableIRQ(TIMER1_IRQn);
	return (1);		
		
  }else if( timer_num == 2 ){ // TIMER 2
	LPC_TIM2->MR0 = TimerInterval;
	LPC_TIM2->MCR = 7;
	NVIC_EnableIRQ(TIMER2_IRQn);
	return (1);	
		
  }else if( timer_num == 3 ){ // TIMER 3
	LPC_TIM3->MR0 = TimerInterval;
	LPC_TIM3->MCR = 7;
	NVIC_EnableIRQ(TIMER3_IRQn);
	return (1);		
		
  }
	
  return (0);
}

/******************************************************************************
**                            End Of File
******************************************************************************/
